<a href="https://colab.research.google.com/github/prashanta4coursera/Panda-EDA-Project/blob/Project/capstone_project.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Project Description**  
InsaidTelecom, one of the leading telecom players, understands that customizing offering is very important for its business to stay competitive.
Currently, InsaidTelecom is seeking to leverage behavioral data from more than 60% of the 50 million mobile devices active daily in India
to help its clients better understand and interact with their audiences.  

In this consulting assignment, Insaidians are expected to build a dashboard to understand user's demographic characteristics based on their mobile usage, geolocation, and mobile device properties.
Doing so will help millions of developers and brand advertisers around the world pursue data-driven marketing efforts which are relevant to their users and catered to their preferences.

**Consulting Goals**  
To help the customer the consultants are expected to have depth of clarity in the underlying data. How much effort has been put into cleansing and purifying the data will decide how closely have you looked at the data.
How detailed is the observation stated in the submission report and finally how well a group presents their consulting journey.

Please remember this is an analytics consulting hence, your efforts in terms of
finding user behavior is going to directly impact the company's offerings.
Do help the company understand what is the right way forward and suggest actionable insights from marketing and product terms.

**Data Description**  
In this assignment, you are going to study the demographics of a user (gender and age) based on their app download and usage behaviors.
The Data is collected from mobile apps that use InsaidTelecom services. Full recognition and consent from individual user of those apps have been obtained,
and appropriate anonymization have been performed to protect privacy. Due to confidentiality, we won't provide details on how the gender and age data was obtained.  
Please treat them as accurate ground truth for prediction. The data schema can be represented in the following table:


gender_age_train - Devices and their respective user gender, age and age_group  

phone_brand_device_model - device ids, brand, and models phone_brand: note that few brands are in Chinese

Brand Name	Brand English Mapping
'华为'	'Huawei'  
'小米'	'Xiaomi'  
'三星'	'Samsung'  
'vivo'	'vivo'  
'OPPO'	'OPPO'  
'魅族'	'Meizu'  
'酷派'	'Coolpad'  
'乐视'	'LeEco'  
'联想 '	'Lenovo'  
'HTC'	'HTC'  
events_data - when a user uses mobile on INSAID Telecom network, the event gets logged in this data.  
Each event has an event id, location (lat/long), and the event corresponds to frequency of mobile usage.   
timestamp: when the user is using the mobile.

Download the DataSets for events_data from : events_data.csv  
https://drive.google.com/uc?export=download&id=1OK4yi-f1v03vS6fBMjuOLKPhNOfjzsh3  
    

Download the DataSets for gender_age_train & phone_brand_device_model onto Python by connecting to the below
provided MySQL instance.  

           
host	'cpanel.insaid.co'  
user	'student'   
passwd	'student'  
database	'Capstone1'  

Use "mysql.connector" package in Python.

In [26]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in /usr/local/lib/python3.6/dist-packages (8.0.19)
Requirement already satisfied: dnspython==1.16.0 in /usr/local/lib/python3.6/dist-packages (from mysql-connector-python) (1.16.0)
Requirement already satisfied: protobuf==3.6.1 in /usr/local/lib/python3.6/dist-packages (from mysql-connector-python) (3.6.1)
Requirement already satisfied: setuptools in /usr/local/lib/python3.6/dist-packages (from protobuf==3.6.1->mysql-connector-python) (45.1.0)
Requirement already satisfied: six>=1.9 in /usr/local/lib/python3.6/dist-packages (from protobuf==3.6.1->mysql-connector-python) (1.12.0)

In [35]:
import mysql.connector
mydb = mysql.connector.connect(
  host="cpanel.insaid.co",
  user="student",
  passwd="student",
  database="Capstone1"
)

mycursor = mydb.cursor()
mycursor.execute("SHOW TABLES")
for x in mycursor :
  print(x)

mycursor1 = mydb.cursor()
mycursor1.execute("SELECT * FROM events_data")
records1 = mycursor1.fetchall()
events_data_sql = pd.DataFrame(records1)
events_data_sql.head(3)

('events_data',)
('gender_age_train',)
('phone_brand_device_model',)

       0             1                   2          3         4      5      6
0      1  2.918269e+16 2016-05-01 00:55:25  77.266052  28.68161  Delhi  Delhi
1   7104  2.918269e+16 2016-05-02 09:37:02  77.266052  28.68161  Delhi  Delhi
2  29661  2.918269e+16 2016-05-04 00:56:04  77.266052  28.68161  Delhi  Delhi

In [36]:

mycursor2 = mydb.cursor()
mycursor2.execute("SELECT * FROM gender_age_train")
records2 = mycursor2.fetchall()
gender_age_train = pd.DataFrame(records2)
gender_age_train.head(3)

                     0  1   2       3
0 -8076087639492063270  M  35  M32-38
1 -2897161552818060146  M  35  M32-38
2 -8260683887967679142  M  35  M32-38

In [37]:

mycursor3 = mydb.cursor()
mycursor3.execute("SELECT * FROM phone_brand_device_model")
records3 = mycursor3.fetchall()
phone_brand_device_model = pd.DataFrame(records3)
phone_brand_device_model.head(3)

                     0     1     2
0  1877775838486905855  vivo   Y13
1 -3766087376657242966    小米  V183
2 -6238937574958215831  OPPO   R7s

In [0]:
mydb.close()

# New Section